FritzSoap/Hosts-GetNumberOfEntries.sh

#!/bin/bash
curl "http://fritz.box:49000/upnp/control/hosts" -H "Content-Type: text/xml; charset="utf-8"" -H "SoapAction:urn:dslforum-org:service:Hosts:1#GetHostNumberOfEntries" -d "<?xml version='1.0' encoding='utf-8'?> <s:Envelope s:encodingStyle='http://schemas.xmlsoap.org/soap/encoding/' xmlns:s='http://schemas.xmlsoap.org/soap/envelope/'> <s:Body> <u:GetHostNumberOfEntries xmlns:u="urn:dslforum-org:service:Hosts:1" /> </s:Body> </s:Envelope>" -s 
